TexasInstruments/c2000ware-core-sdk/driverlib/f2837xs/driverlib/inc/hw_sysctl.h
//###########################################################################
//
// FILE:    hw_sysctl.h
//
// TITLE:   Definitions for the SYSCTL registers.
//
//###########################################################################
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*************************************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*************************************************************************************************
#define SYSCTL_O_PARTIDL      0x8U     // Lower 32-bit of Device PART Identification Number
#define SYSCTL_O_PARTIDH      0xAU     // Upper 32-bit of Device PART Identification Number
#define SYSCTL_O_REVID        0xCU     // Device Revision Number
#define SYSCTL_O_DC0          0x10U    // Device Capability: Device Information
#define SYSCTL_O_DC1          0x12U    // Device Capability: Processing Block Customization
#define SYSCTL_O_DC2          0x14U    // Device Capability: EMIF Customization
#define SYSCTL_O_DC3          0x16U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC4          0x18U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC5          0x1AU    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC6          0x1CU    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC7          0x1EU    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC8          0x20U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC9          0x22U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC10         0x24U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC11         0x26U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC12         0x28U    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC13         0x2AU    // Device Capability: Peripheral Customization
#define SYSCTL_O_DC14         0x2CU    // Device Capability: Analog Modules Customization
#define SYSCTL_O_DC15         0x2EU    // Device Capability: Analog Modules Customization
#define SYSCTL_O_DC17         0x32U    // Device Capability: Analog Modules Customization
#define SYSCTL_O_DC18         0x34U    // Device Capability: CPU1 Lx SRAM Customization
#define SYSCTL_O_DC20         0x38U    // Device Capability: GSx SRAM Customization
#define SYSCTL_O_PERCNF1      0x60U    // Peripheral Configuration register
#define SYSCTL_O_FUSEERR      0x74U    // e-Fuse error Status register
#define SYSCTL_O_SOFTPRES0    0x82U    // Processing Block Software Reset register
#define SYSCTL_O_SOFTPRES1    0x84U    // EMIF Software Reset register
#define SYSCTL_O_SOFTPRES2    0x86U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES3    0x88U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES4    0x8AU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES6    0x8EU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES7    0x90U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES8    0x92U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES9    0x94U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES11   0x98U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES13   0x9CU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES14   0x9EU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES16   0xA2U    // Peripheral Software Reset register
#define SYSCTL_O_SYSDBGCTL    0x12CU   // System Debug Control register

#define SYSCTL_O_CLKCFGLOCK1     0x2U    // Lock bit for CLKCFG registers
#define SYSCTL_O_CLKSRCCTL1      0x8U    // Clock Source Control register-1
#define SYSCTL_O_CLKSRCCTL2      0xAU    // Clock Source Control register-2
#define SYSCTL_O_CLKSRCCTL3      0xCU    // Clock Source Control register-3
#define SYSCTL_O_SYSPLLCTL1      0xEU    // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT      0x14U   // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLLSTS       0x16U   // SYSPLL Status register
#define SYSCTL_O_AUXPLLCTL1      0x18U   // AUXPLL Control register-1
#define SYSCTL_O_AUXPLLMULT      0x1EU   // AUXPLL Multiplier register
#define SYSCTL_O_AUXPLLSTS       0x20U   // AUXPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL    0x22U   // System Clock Divider Select register
#define SYSCTL_O_AUXCLKDIVSEL    0x24U   // Auxillary Clock Divider Select register
#define SYSCTL_O_PERCLKDIVSEL    0x26U   // Peripheral Clock Divider Selet register
#define SYSCTL_O_XCLKOUTDIVSEL   0x28U   // XCLKOUT Divider Select register
#define SYSCTL_O_LOSPCP          0x2CU   // Low Speed Clock Source Prescalar
#define SYSCTL_O_MCDCR           0x2EU   // Missing Clock Detect Control Register
#define SYSCTL_O_X1CNT           0x30U   // 10-bit Counter on X1 Clock

#define SYSCTL_O_CPUSYSLOCK1     0x0U    // Lock bit for CPUSYS registers
#define SYSCTL_O_HIBBOOTMODE     0x6U    // HIB Boot Mode Register
#define SYSCTL_O_IORESTOREADDR   0x8U    // IORestore() routine Address Register
#define SYSCTL_O_PIEVERRADDR     0xAU    // PIE Vector Fetch Error Address register
#define SYSCTL_O_PCLKCR0         0x22U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR1         0x24U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR2         0x26U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR3         0x28U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR4         0x2AU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR6         0x2EU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR7         0x30U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR8         0x32U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR9         0x34U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR10        0x36U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR11        0x38U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR12        0x3AU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR13        0x3CU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR14        0x3EU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR16        0x42U   // Peripheral Clock Gating Registers
#define SYSCTL_O_SECMSEL         0x74U   // Secondary Master Select register for common
                                         // peripherals: Selects between CLA & DMA
#define SYSCTL_O_LPMCR           0x76U   // LPM Control Register
#define SYSCTL_O_GPIOLPMSEL0     0x78U   // GPIO LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL1     0x7AU   // GPIO LPM Wakeup select registers
#define SYSCTL_O_TMR2CLKCTL      0x7CU   // Timer2 Clock Measurement functionality control register
#define SYSCTL_O_RESC            0x80U   // Reset Cause register

#define SYSCTL_O_SCSR     0x22U   // System Control & Status Register
#define SYSCTL_O_WDCNTR   0x23U   // Watchdog Counter Register
#define SYSCTL_O_WDKEY    0x25U   // Watchdog Reset Key Register
#define SYSCTL_O_WDCR     0x29U   // Watchdog Control Register
#define SYSCTL_O_WDWCR    0x2AU   // Watchdog Windowed Control Register

#define SYSCTL_O_CLA1TASKSRCSELLOCK   0x0U    // CLA1 Task Trigger Source Select Lock Register
#define SYSCTL_O_DMACHSRCSELLOCK      0x4U    // DMA Channel Triger Source Select Lock Register
#define SYSCTL_O_CLA1TASKSRCSEL1      0x6U    // CLA1 Task Trigger Source Select Register-1
#define SYSCTL_O_CLA1TASKSRCSEL2      0x8U    // CLA1 Task Trigger Source Select Register-2
#define SYSCTL_O_DMACHSRCSEL1         0x16U   // DMA Channel Trigger Source Select Register-1
#define SYSCTL_O_DMACHSRCSEL2         0x18U   // DMA Channel Trigger Source Select Register-2

