TexasInstruments/c2000ware-core-sdk/driverlib/f2837xs/driverlib/inc/hw_sysctl.h
#define SYSCTL_O_SYNCSELECT        0x0U   // Sync Input and Output Select Register
#define SYSCTL_O_ADCSOCOUTSELECT   0x2U   // External ADC (Off Chip) SOC Select Register
#define SYSCTL_O_SYNCSOCLOCK       0x4U   // SYNCSEL and EXTADCSOC Select Lock register


//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDL register
//
//*************************************************************************************************
#define SYSCTL_PARTIDL_QUAL_S                     6U
#define SYSCTL_PARTIDL_QUAL_M                     0xC0U         // Qualification Status
#define SYSCTL_PARTIDL_PIN_COUNT_S                8U
#define SYSCTL_PARTIDL_PIN_COUNT_M                0x700U        // Device Pin Count
#define SYSCTL_PARTIDL_INSTASPIN_S                13U
#define SYSCTL_PARTIDL_INSTASPIN_M                0x6000U       // Motorware feature set
#define SYSCTL_PARTIDL_FLASH_SIZE_S               16U
#define SYSCTL_PARTIDL_FLASH_SIZE_M               0xFF0000U     // Flash size in KB
#define SYSCTL_PARTIDL_PARTID_FORMAT_REVISION_S   28U
#define SYSCTL_PARTIDL_PARTID_FORMAT_REVISION_M   0xF0000000U   // Revision of the PARTID format

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDH register
//
//*************************************************************************************************
#define SYSCTL_PARTIDH_FAMILY_S            8U
#define SYSCTL_PARTIDH_FAMILY_M            0xFF00U       // Device family
#define SYSCTL_PARTIDH_PARTNO_S            16U
#define SYSCTL_PARTIDH_PARTNO_M            0xFF0000U     // Device part number
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_S   24U
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_M   0xFF000000U   // Device class ID

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC0 register
//
//*************************************************************************************************
#define SYSCTL_DC0_SINGLE_CORE   0x1U   // Single Core vs Dual Core

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC1 register
//
//*************************************************************************************************
#define SYSCTL_DC1_CPU1_FPU_TMU   0x1U    // CPU1's FPU1+TMU1
#define SYSCTL_DC1_CPU1_VCU       0x4U    // CPU1's VCU
#define SYSCTL_DC1_CPU1_CLA1      0x40U   // CPU1.CLA1

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC2 register
//
//*************************************************************************************************
#define SYSCTL_DC2_EMIF1   0x1U   // EMIF1
#define SYSCTL_DC2_EMIF2   0x2U   // EMIF2

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC3 register
//
//*************************************************************************************************
#define SYSCTL_DC3_EPWM1    0x1U     // EPWM1
#define SYSCTL_DC3_EPWM2    0x2U     // EPWM2
#define SYSCTL_DC3_EPWM3    0x4U     // EPWM3
#define SYSCTL_DC3_EPWM4    0x8U     // EPWM4
#define SYSCTL_DC3_EPWM5    0x10U    // EPWM5
#define SYSCTL_DC3_EPWM6    0x20U    // EPWM6
#define SYSCTL_DC3_EPWM7    0x40U    // EPWM7
#define SYSCTL_DC3_EPWM8    0x80U    // EPWM8
#define SYSCTL_DC3_EPWM9    0x100U   // EPWM9
#define SYSCTL_DC3_EPWM10   0x200U   // EPWM10
#define SYSCTL_DC3_EPWM11   0x400U   // EPWM11
#define SYSCTL_DC3_EPWM12   0x800U   // EPWM12

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC4 register
//
//*************************************************************************************************
#define SYSCTL_DC4_ECAP1   0x1U    // ECAP1
#define SYSCTL_DC4_ECAP2   0x2U    // ECAP2
#define SYSCTL_DC4_ECAP3   0x4U    // ECAP3
#define SYSCTL_DC4_ECAP4   0x8U    // ECAP4
#define SYSCTL_DC4_ECAP5   0x10U   // ECAP5
#define SYSCTL_DC4_ECAP6   0x20U   // ECAP6

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC5 register
//
//*************************************************************************************************
#define SYSCTL_DC5_EQEP1   0x1U   // EQEP1
#define SYSCTL_DC5_EQEP2   0x2U   // EQEP2
#define SYSCTL_DC5_EQEP3   0x4U   // EQEP3

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC6 register
//
//*************************************************************************************************
#define SYSCTL_DC6_CLB1   0x1U   // CLB1
#define SYSCTL_DC6_CLB2   0x2U   // CLB2
#define SYSCTL_DC6_CLB3   0x4U   // CLB3
#define SYSCTL_DC6_CLB4   0x8U   // CLB4

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC7 register
//
//*************************************************************************************************
#define SYSCTL_DC7_SD1   0x1U   // SD1
#define SYSCTL_DC7_SD2   0x2U   // SD2

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC8 register
//
//*************************************************************************************************
#define SYSCTL_DC8_SCI_A   0x1U   // SCI_A
#define SYSCTL_DC8_SCI_B   0x2U   // SCI_B
#define SYSCTL_DC8_SCI_C   0x4U   // SCI_C
#define SYSCTL_DC8_SCI_D   0x8U   // SCI_D

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC9 register
//
//*************************************************************************************************
#define SYSCTL_DC9_SPI_A   0x1U   // SPI_A
#define SYSCTL_DC9_SPI_B   0x2U   // SPI_B
#define SYSCTL_DC9_SPI_C   0x4U   // SPI_C

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC10 register
//
//*************************************************************************************************
#define SYSCTL_DC10_I2C_A   0x1U   // I2C_A
#define SYSCTL_DC10_I2C_B   0x2U   // I2C_B

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC11 register
//
//*************************************************************************************************
#define SYSCTL_DC11_CAN_A   0x1U   // CAN_A
#define SYSCTL_DC11_CAN_B   0x2U   // CAN_B

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC12 register
//
//*************************************************************************************************
#define SYSCTL_DC12_MCBSP_A   0x1U       // McBSP_A
#define SYSCTL_DC12_MCBSP_B   0x2U       // McBSP_B
#define SYSCTL_DC12_USB_A_S   16U
#define SYSCTL_DC12_USB_A_M   0x30000U   // Decides the capability of the USB_A Module

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC13 register
//
//*************************************************************************************************
#define SYSCTL_DC13_UPP_A   0x1U   // uPP_A

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC14 register
//
//*************************************************************************************************
#define SYSCTL_DC14_ADC_A   0x1U   // ADC_A
#define SYSCTL_DC14_ADC_B   0x2U   // ADC_B
#define SYSCTL_DC14_ADC_C   0x4U   // ADC_C
#define SYSCTL_DC14_ADC_D   0x8U   // ADC_D

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC15 register
//
//*************************************************************************************************
#define SYSCTL_DC15_CMPSS1   0x1U    // CMPSS1
#define SYSCTL_DC15_CMPSS2   0x2U    // CMPSS2
#define SYSCTL_DC15_CMPSS3   0x4U    // CMPSS3
#define SYSCTL_DC15_CMPSS4   0x8U    // CMPSS4
#define SYSCTL_DC15_CMPSS5   0x10U   // CMPSS5
#define SYSCTL_DC15_CMPSS6   0x20U   // CMPSS6
#define SYSCTL_DC15_CMPSS7   0x40U   // CMPSS7
#define SYSCTL_DC15_CMPSS8   0x80U   // CMPSS8

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC17 register
//
//*************************************************************************************************
#define SYSCTL_DC17_DAC_A   0x10000U   // Buffered-DAC_A
#define SYSCTL_DC17_DAC_B   0x20000U   // Buffered-DAC_B
#define SYSCTL_DC17_DAC_C   0x40000U   // Buffered-DAC_C

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC18 register
//
//*************************************************************************************************
#define SYSCTL_DC18_LS0_1   0x1U    // LS0_1
#define SYSCTL_DC18_LS1_1   0x2U    // LS1_1
#define SYSCTL_DC18_LS2_1   0x4U    // LS2_1
#define SYSCTL_DC18_LS3_1   0x8U    // LS3_1
#define SYSCTL_DC18_LS4_1   0x10U   // LS4_1
#define SYSCTL_DC18_LS5_1   0x20U   // LS5_1

//*************************************************************************************************
//
// The following are defines for the bit fields in the DC20 register
//
//*************************************************************************************************
#define SYSCTL_DC20_GS0    0x1U      // GS0
#define SYSCTL_DC20_GS1    0x2U      // GS1
#define SYSCTL_DC20_GS2    0x4U      // GS2
#define SYSCTL_DC20_GS3    0x8U      // GS3
#define SYSCTL_DC20_GS4    0x10U     // GS4
#define SYSCTL_DC20_GS5    0x20U     // GS5
#define SYSCTL_DC20_GS6    0x40U     // GS6
#define SYSCTL_DC20_GS7    0x80U     // GS7
#define SYSCTL_DC20_GS8    0x100U    // GS8
#define SYSCTL_DC20_GS9    0x200U    // GS9
#define SYSCTL_DC20_GS10   0x400U    // GS10
#define SYSCTL_DC20_GS11   0x800U    // GS11
#define SYSCTL_DC20_GS12   0x1000U   // GS12
#define SYSCTL_DC20_GS13   0x2000U   // GS13
#define SYSCTL_DC20_GS14   0x4000U   // GS14
#define SYSCTL_DC20_GS15   0x8000U   // GS15

//*************************************************************************************************
//
// The following are defines for the bit fields in the PERCNF1 register
//
//*************************************************************************************************
#define SYSCTL_PERCNF1_ADC_A_MODE   0x1U       // ADC_A mode setting bit
#define SYSCTL_PERCNF1_ADC_B_MODE   0x2U       // ADC_B mode setting bit
#define SYSCTL_PERCNF1_ADC_C_MODE   0x4U       // ADC_C mode setting bit
#define SYSCTL_PERCNF1_ADC_D_MODE   0x8U       // ADC_D mode setting bit
#define SYSCTL_PERCNF1_USB_A_PHY    0x10000U   // USB_A_PHY

//*************************************************************************************************
//
// The following are defines for the bit fields in the FUSEERR register
//
//*************************************************************************************************
#define SYSCTL_FUSEERR_ALERR_S   0U
#define SYSCTL_FUSEERR_ALERR_M   0x1FU   // Efuse Autoload Error Status
#define SYSCTL_FUSEERR_ERR       0x20U   // Efuse Self Test Error Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES0 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES0_CPU1_CLA1   0x1U   // CPU1_CLA1 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES1 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES1_EMIF1   0x1U   // EMIF1 software reset bit
#define SYSCTL_SOFTPRES1_EMIF2   0x2U   // EMIF2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES2 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES2_EPWM1    0x1U     // EPWM1 software reset bit
#define SYSCTL_SOFTPRES2_EPWM2    0x2U     // EPWM2 software reset bit
#define SYSCTL_SOFTPRES2_EPWM3    0x4U     // EPWM3 software reset bit
#define SYSCTL_SOFTPRES2_EPWM4    0x8U     // EPWM4 software reset bit
#define SYSCTL_SOFTPRES2_EPWM5    0x10U    // EPWM5 software reset bit
#define SYSCTL_SOFTPRES2_EPWM6    0x20U    // EPWM6 software reset bit
#define SYSCTL_SOFTPRES2_EPWM7    0x40U    // EPWM7 software reset bit
#define SYSCTL_SOFTPRES2_EPWM8    0x80U    // EPWM8 software reset bit
#define SYSCTL_SOFTPRES2_EPWM9    0x100U   // EPWM9 software reset bit
#define SYSCTL_SOFTPRES2_EPWM10   0x200U   // EPWM10 software reset bit
#define SYSCTL_SOFTPRES2_EPWM11   0x400U   // EPWM11 software reset bit
#define SYSCTL_SOFTPRES2_EPWM12   0x800U   // EPWM12 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES3 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES3_ECAP1   0x1U    // ECAP1 software reset bit
#define SYSCTL_SOFTPRES3_ECAP2   0x2U    // ECAP2 software reset bit
#define SYSCTL_SOFTPRES3_ECAP3   0x4U    // ECAP3 software reset bit
#define SYSCTL_SOFTPRES3_ECAP4   0x8U    // ECAP4 software reset bit
#define SYSCTL_SOFTPRES3_ECAP5   0x10U   // ECAP5 software reset bit
#define SYSCTL_SOFTPRES3_ECAP6   0x20U   // ECAP6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES4 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES4_EQEP1   0x1U   // EQEP1 software reset bit
#define SYSCTL_SOFTPRES4_EQEP2   0x2U   // EQEP2 software reset bit
#define SYSCTL_SOFTPRES4_EQEP3   0x4U   // EQEP3 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES6 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES6_SD1   0x1U   // SD1 software reset bit
#define SYSCTL_SOFTPRES6_SD2   0x2U   // SD2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES7 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES7_SCI_A   0x1U   // SCI_A software reset bit
#define SYSCTL_SOFTPRES7_SCI_B   0x2U   // SCI_B software reset bit
#define SYSCTL_SOFTPRES7_SCI_C   0x4U   // SCI_C software reset bit
#define SYSCTL_SOFTPRES7_SCI_D   0x8U   // SCI_D software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES8 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES8_SPI_A   0x1U   // SPI_A software reset bit
#define SYSCTL_SOFTPRES8_SPI_B   0x2U   // SPI_B software reset bit
#define SYSCTL_SOFTPRES8_SPI_C   0x4U   // SPI_C software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES9 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES9_I2C_A   0x1U   // I2C_A software reset bit
#define SYSCTL_SOFTPRES9_I2C_B   0x2U   // I2C_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES11 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES11_MCBSP_A   0x1U       // McBSP_A software reset bit
#define SYSCTL_SOFTPRES11_MCBSP_B   0x2U       // McBSP_B software reset bit
#define SYSCTL_SOFTPRES11_USB_A     0x10000U   // USB_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES13 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES13_ADC_A   0x1U   // ADC_A software reset bit
#define SYSCTL_SOFTPRES13_ADC_B   0x2U   // ADC_B software reset bit
#define SYSCTL_SOFTPRES13_ADC_C   0x4U   // ADC_C software reset bit
#define SYSCTL_SOFTPRES13_ADC_D   0x8U   // ADC_D software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES14 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES14_CMPSS1   0x1U    // CMPSS1 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS2   0x2U    // CMPSS2 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS3   0x4U    // CMPSS3 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS4   0x8U    // CMPSS4 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS5   0x10U   // CMPSS5 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS6   0x20U   // CMPSS6 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS7   0x40U   // CMPSS7 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS8   0x80U   // CMPSS8 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES16 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES16_DAC_A   0x10000U   // Buffered_DAC_A software reset bit
#define SYSCTL_SOFTPRES16_DAC_B   0x20000U   // Buffered_DAC_B software reset bit
#define SYSCTL_SOFTPRES16_DAC_C   0x40000U   // Buffered_DAC_C software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSDBGCTL register
//
//*************************************************************************************************
#define SYSCTL_SYSDBGCTL_BIT_0   0x1U   // Used in PLL startup. Only reset by POR.


//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKCFGLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL1     0x1U      // Lock bit for CLKSRCCTL1 register
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL2     0x2U      // Lock bit for CLKSRCCTL2 register
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL3     0x4U      // Lock bit for CLKSRCCTL3 register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL1     0x8U      // Lock bit for SYSPLLCTL1 register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL2     0x10U     // Lock bit for SYSPLLCTL2 register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL3     0x20U     // Lock bit for SYSPLLCTL3 register
#define SYSCTL_CLKCFGLOCK1_SYSPLLMULT     0x40U     // Lock bit for SYSPLLMULT register
#define SYSCTL_CLKCFGLOCK1_AUXPLLCTL1     0x80U     // Lock bit for AUXPLLCTL1 register
#define SYSCTL_CLKCFGLOCK1_AUXPLLMULT     0x400U    // Lock bit for AUXPLLMULT register
#define SYSCTL_CLKCFGLOCK1_SYSCLKDIVSEL   0x800U    // Lock bit for SYSCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_AUXCLKDIVSEL   0x1000U   // Lock bit for AUXCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_PERCLKDIVSEL   0x2000U   // Lock bit for PERCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_LOSPCP         0x8000U   // Lock bit for LOSPCP register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL1 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_S   0U
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_M   0x3U    // OSCCLK Source Select Bit
#define SYSCTL_CLKSRCCTL1_INTOSC2OFF       0x8U    // Internal Oscillator 2 Off Bit
#define SYSCTL_CLKSRCCTL1_XTALOFF          0x10U   // Crystal (External) Oscillator Off Bit
#define SYSCTL_CLKSRCCTL1_WDHALTI          0x20U   // Watchdog HALT Mode Ignore Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL2 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL2_AUXOSCCLKSRCSEL_S   0U
#define SYSCTL_CLKSRCCTL2_AUXOSCCLKSRCSEL_M   0x3U    // AUXOSCCLK Source Select Bit
#define SYSCTL_CLKSRCCTL2_CANABCLKSEL_S       2U
#define SYSCTL_CLKSRCCTL2_CANABCLKSEL_M       0xCU    // CANA Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_CANBBCLKSEL_S       4U
#define SYSCTL_CLKSRCCTL2_CANBBCLKSEL_M       0x30U   // CANB Bit Clock Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL3 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_S   0U
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_M   0x7U   // XCLKOUT Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLCTL1 register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLCTL1_PLLEN      0x1U   // SYSPLL enable/disable bit
#define SYSCTL_SYSPLLCTL1_PLLCLKEN   0x2U   // SYSPLL bypassed or included in the PLLSYSCLK path

